# Tyler Banks
## Week 13 - 04/25/21
### Python - Pandas DataFrame Processing

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
#drop entries
df = DataFrame(np.arange(16).reshape((4,4)),
            index = ['Ohio','Colorado','Utah','New York'],
            columns=['one','two','three','four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [3]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [4]:
df.drop(['Colorado'])

          one  two  three  four
Ohio        0    1      2     3
Utah        8    9     10    11
New York   12   13     14    15

In [5]:
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [6]:
df.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [7]:
df.drop('two',axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [8]:
df.drop('two',axis = 'columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [9]:
df.drop('two',inplace=True, axis = 'columns')
df

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [10]:
#select entries
df = DataFrame(np.arange(16).reshape((4,4)),
            index = ['Ohio','Colorado','Utah','New York'],
            columns=['one','two','three','four'])
df

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [11]:
df['one']

Ohio         0
Colorado     4
Utah         8
New York    12
Name: one, dtype: int32

In [12]:
df[['one','four']]

          one  four
Ohio        0     3
Colorado    4     7
Utah        8    11
New York   12    15

In [13]:
df[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [14]:
df[df['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [15]:
df>5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [16]:
df[ df < 5] = 0
df

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [17]:
df[:2]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7

In [18]:
df[df['three']>5]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [19]:
df[ df < 5] = 0
df

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [20]:
#select entries with loc and iloc
df.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [21]:
df.loc['Colorado', ['two','four']]

two     5
four    7
Name: Colorado, dtype: int32

In [22]:
df

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
df.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [24]:
df.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [25]:
df.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [26]:
#Arithmetic and alignment of data
df1 = DataFrame(np.arange(9).reshape((3,3)), columns = list('bcd'),
                        index = ['Ohio','Texas','Colorado'])

df2 = DataFrame(np.arange(12).reshape((4,3)), columns = list('bde'),
                        index = ['Utah','Ohio','Texas','Oregon'])

df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [27]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [28]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [29]:
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [30]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [31]:
df1['e'] = df1['b'] + df1['d']

In [32]:
df1

          b  c  d   e
Ohio      0  1  2   2
Texas     3  4  5   8
Colorado  6  7  8  14

In [33]:
df1.add(df2,fill_value = 0)

            b    c     d     e
Colorado  6.0  7.0   8.0  14.0
Ohio      3.0  1.0   6.0   7.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0  16.0
Utah      0.0  NaN   1.0   2.0

In [34]:
# operation between DataFrame and Series
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [35]:
s = df2.iloc[0]
s

b    0
d    1
e    2
Name: Utah, dtype: int32

In [36]:
df2 - s

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [37]:
#sort and rank
df3 = DataFrame(np.arange(8).reshape(2,4), columns = list('dabc'),
               index = ['three','one'])

df3

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [38]:
df3.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [39]:
df3.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [40]:
df3.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [41]:
df4 = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})
df4

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [42]:
df4.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [43]:
df4.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [44]:
df4

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [45]:
df5 = DataFrame({'b':[14,17,-13,12], 'a':[10,11,10,11]})
df5

    b   a
0  14  10
1  17  11
2 -13  10
3  12  11

In [46]:
df4.rank()

     b    a
0  3.0  1.5
1  4.0  3.5
2  1.0  1.5
3  2.0  3.5

In [48]:
#summarizing data
df = DataFrame([[1.4,np.nan], [7.1,-4.5], [np.nan,np.nan], [0.75,-1.3]],
               index = ['a','b','c','d'],
               columns = ['one','two'])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [49]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [50]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [51]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [52]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [53]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [54]:
df.min()

one    0.75
two   -4.50
dtype: float64

In [55]:
df.min(axis=1)

a    1.4
b   -4.5
c    NaN
d   -1.3
dtype: float64

In [56]:
df.idxmax()

one    b
two    d
dtype: object

In [57]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [58]:
df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [59]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [60]:
#missing data
df = DataFrame([[1,2,3,4],[np.nan,5.6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.6  NaN  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [61]:
clean_df = df.dropna()

clean_df

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [62]:
df.dropna(how='all')

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.6  NaN  NaN
2  7.0  NaN  9.0  NaN

In [63]:
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [64]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.6  NaN  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [65]:
df.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  4.0
2  7.0  NaN  9.0  NaN

In [66]:
df.dropna(thresh=3)

     0    1    2    3
0  1.0  2.0  3.0  4.0

In [67]:
df.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.6  0.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [68]:
df.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  5.6  1.0  1.0
2  7.0  1.0  9.0  1.0
3  1.0  1.0  1.0  1.0

In [69]:
df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  NaN  5.6  NaN  NaN
2  7.0  NaN  9.0  NaN
3  NaN  NaN  NaN  NaN

In [70]:
df.fillna(0,inplace=True)

df

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  0.0  5.6  0.0  0.0
2  7.0  0.0  9.0  0.0
3  0.0  0.0  0.0  0.0

In [72]:
# value counts
df = DataFrame({'Qu1':[1,3,4,3,4],
               'Qu2':[2,3,1,2,3],
               'Qu3':[1,5,2,4,4]},
              index=['a','b','c','d','e'])

df

   Qu1  Qu2  Qu3
a    1    2    1
b    3    3    5
c    4    1    2
d    3    2    4
e    4    3    4

In [73]:
df['Qu1'].value_counts()

4    2
3    2
1    1
Name: Qu1, dtype: int64

In [74]:
rs = df.apply(pd.value_counts)

rs

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [75]:
rs.fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [76]:
rs.index.name='values'

rs

        Qu1  Qu2  Qu3
values
1       1.0  1.0  1.0
2       NaN  2.0  1.0
3       2.0  2.0  NaN
4       2.0  NaN  2.0
5       NaN  NaN  1.0